# Pandas - Filtering Dataframes and Series OBJECTS

In [4]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreySchafer@Gmail.com", "JaneDoe@Gmail.com", "JohnDoe@Gmail.com"]
}

In [5]:
import pandas as pd
df = pd.DataFrame(people)
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@Gmail.com
1   Jane      Doe       JaneDoe@Gmail.com
2   John      Doe       JohnDoe@Gmail.com

## Bases of for our filters:

In [6]:
#Basic comparison
is_doe = (df["last"] == "Doe")
#This returns a Series
#This is a filter mask
is_doe

0    False
1     True
2     True
Name: last, dtype: bool

In [7]:
#appply the mask/filter to dataframe
df[is_doe]

  first last              email
1  Jane  Doe  JaneDoe@Gmail.com
2  John  Doe  JohnDoe@Gmail.com

In [31]:
#Another way. using .loc. (somepeople like this)
# We can get more information
df.loc[is_doe,]

  first last              email
1  Jane  Doe  JaneDoe@Gmail.com
2  John  Doe  JohnDoe@Gmail.com

### And & and Or | opperators (filters)

In [49]:
# doe and john
filt = (df["last"]=="Doe") & (df["first"] == "John") # and
filt2 = (df["last"]=="Doe") | (df["first"] == "John") # or

In [47]:
df[filt]

  first last              email
1  Jane  Doe  JaneDoe@Gmail.com
2  John  Doe  JohnDoe@Gmail.com

In [50]:
df[filt2]

  first last              email
1  Jane  Doe  JaneDoe@Gmail.com
2  John  Doe  JohnDoe@Gmail.com

### Not opperator ~

In [51]:
df[~filt]

   first     last                   email
0  Corey  Schafer  CoreySchafer@Gmail.com
1   Jane      Doe       JaneDoe@Gmail.com

### Lets Practice

In [55]:
pok = pd.read_csv("Pokemon.csv")
df = pd.DataFrame(pok)
df.head(2)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False

In [63]:
# pokemon with Total Points over 700 and Attack over 150
filt = (df["Total"] > 700) & (df["Attack"] > 150)

In [64]:
df.loc[filt, ["Name", "Total", "Attack"]]

                      Name  Total  Attack
163    MewtwoMega Mewtwo X    780     190
424  GroudonPrimal Groudon    770     180
426  RayquazaMega Rayquaza    780     180

In [84]:
#lets find all the Grass and Fire type Pokemon
grass_fire_filt = ["Grass", "Fire"]
filt2 = df["Type 1"].isin(grass_fire_filt)
df.loc[filt2, ["Type 1", "Name"] ]

    Type 1                   Name
0    Grass              Bulbasaur
1    Grass                Ivysaur
2    Grass               Venusaur
3    Grass  VenusaurMega Venusaur
4     Fire             Charmander
..     ...                    ...
735   Fire                 Litleo
736   Fire                 Pyroar
740  Grass                 Skiddo
741  Grass                 Gogoat
799   Fire              Volcanion

[122 rows x 2 columns]

### Using a STRING METHOD to filter: .str.contains("" , na = false)

In [85]:
df.head(3)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

# In conclusion:

When we filter ,we get a series of True and False returns. We then pass it to the dataframe and the results are showed.